LEXICON: dict[str, str] = {
    '/start': '<b>Привет!</b>\nДавай с тобой сыграем в игру '
              '"Камень, ножницы, бумага"?\n\n<b>Играем?</b>',
    'rock': 'Камень 🗿',
    'scissors': 'Ножницы ✂',
    'paper': 'Бумага 📜',
    'yes_button': 'Давай',
    'no_button': 'Не хочу',
    'other_answer': 'Извини, это сообщение мне непонятно',
    'yes': 'Отлично! Делай свой выбор',
    'no': 'Жаль...\nЕсли захочешь сыграть, просто разверни '
          'клавиатуру и нажми кнопку "Давай!"',
    'bot_won': 'Я победил!\n\nСыграем еще?',
    'user_won': 'Ты победил! Поздравляю!\n\nДавай сыграем еще?',
    'nobody_won': 'Ничья!\n\n Продолжим?',
    'bot_choice': 'Мой выбор'
}